{
  "posts": [
    {
      "slug": "how-to-build-your-own-bank",
      "title": "How to Build Your Own Bank: A Conversation That Could Change Your Financial Future",
      "excerpt": "In a world where families are taught to chase returns, Brad Raschke reminds us that real financial freedom isn't found in Wall Street—it's found in stewardship.",
      "date": "May 15, 2025",
      "readTime": "8 min read",
      "author": "Brad Raschke",
      "authorImage": "/images/brad-portrait-new.jpeg",
      "authorTitle": "Founder & Steward of Strategy, 1322 Legacy Strategies",
      "image": "/images/how-to-be-your-own-bank.png",
      "category": "Infinite Banking",
      "content": "<h2>In a world where families are taught to chase returns, Brad Raschke reminds us that real financial freedom isn't found in Wall Street—it's found in stewardship.</h2><p>In this archived episode of the Screw the Stock Market podcast, Brad breaks down one of the most misunderstood but powerful financial tools available today: dividend-paying whole life insurance structured for Infinite Banking. Whether you're a small business owner or a family seeking lasting financial control, this conversation is worth your time—and your reflection.</p><div class=\"video-container\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/kUpw0wIqxPs?si=-7fwdLYKu-cBgPSs\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div><h2>It's Not About Insurance. It's About Capitalization.</h2><p>Many people hear \"whole life insurance\" and think, \"That's just for the death benefit.\" Brad gently flips that script.</p><p>This isn't about dying with money. It's about living with liquidity.</p><p>Brad shares how a properly designed whole life policy can become your personal banking system—one that:</p><ul><li>Grows with guaranteed compounding</li><li>Offers tax-advantaged access to cash</li><li>Lets you borrow against your own capital without interrupting its growth</li><li>Creates long-term financial leverage that serves your family, not external lenders</li></ul><p>As Brad puts it: \"This is not investing. It's capitalization. You're building a system that gives you access, control, and peace.\"</p><h2>What Makes Infinite Banking So Different?</h2><p>The Infinite Banking Concept, pioneered by Nelson Nash, reframes how we think about money. Instead of surrendering your dollars to banks or brokers, you become the banker—earning dividends, maintaining liquidity, and redirecting interest payments back into your own household.</p><p>Some highlights from Brad's discussion include:</p><ul><li>Mortgage-style mindset: Just like building equity in a home, your policy builds equity—cash value that's yours to borrow and use.</li><li>Loan flexibility: No credit checks. No fixed repayment terms. You repay on your terms, with interest coming back to your system.</li><li>Uninterrupted compounding: Your cash value keeps growing—even when you borrow against it.</li><li>Strategic structure: Policies front-load costs, but by year five, many are breaking even—and then accelerating.</li></ul><h2>Why Brad Raschke's Voice Matters</h2><p>Brad doesn't just know the mechanics—he's lived them. With roots in traditional insurance and years of study under the guidance of Infinite Banking mentors, Brad brings a relational, real-world clarity that's hard to find in financial circles.</p><p>He breaks down complex ideas with warmth and wisdom, never pushing product—always teaching stewardship.</p><p>As he says in the episode:</p><blockquote><p>\"You're not just buying a policy. You're building a capital system for your family's future.\"</p></blockquote><h2>If You're Considering Infinite Banking, Start Here</h2><p>This episode is the perfect introduction for anyone who's curious—but cautious. Brad walks through:</p><ul><li>✅ What cash value really is</li><li>✅ How loans affect your policy's long-term performance</li><li>✅ How to avoid common structuring mistakes</li><li>✅ The difference between \"negative equity\" early on and compounding momentum later</li><li>✅ How small businesses and families can use policies to fund opportunities, not just emergencies</li></ul><p>He even shares recommended resources like Ryan Griggs' Banking with Life podcast and Nelson Nash's foundational book, Becoming Your Own Banker.</p><h2>The Steward's First Step? Understanding.</h2><p>Infinite Banking isn't a shortcut—it's a mindset shift. And like all great stewardship journeys, it begins with learning.</p><p>So if you've ever wondered how to control your capital without giving up liquidity…<br>If you're tired of asking banks for permission to use your own money…<br>If you're ready to build a legacy instead of just an account balance…</p><p>📺 <a href=\"https://youtu.be/kUpw0wIqxPs?si=-7fwdLYKu-cBgPSs\" target=\"_blank\">Watch the full episode: Click here to watch Brad's Infinite Banking interview on YouTube</a></p><p>📚 Read the book: Becoming Your Own Banker by Nelson Nash</p><p>📞 Have a conversation: Brad is available. He'll walk with you—patiently and personally.</p><h2>Control your capital. Build your legacy.</h2><p>The system exists. The structure matters.<br>Now the choice is yours.</p>",
      "relatedPosts": [
        {
          "title": "Infinite Banking: Becoming Your Own Source of Financing",
          "slug": "infinite-banking-concept",
          "image": "/images/blog-post-3.png"
        },
        {
          "title": "The Difference Between Stewardship and Management",
          "slug": "stewardship-vs-management",
          "image": "/images/blog-post-1-new.png"
        }
      ]
    },
    {
      "slug": "stewardship-vs-management",
      "title": "The Difference Between Stewardship and Management",
      "excerpt": "Discover why stewardship is a higher calling than mere management, and how this shift in perspective transforms your relationship with wealth.",
      "date": "June 15, 2023",
      "readTime": "5 min read",
      "author": "Brad Raschke",
      "authorImage": "/images/brad-portrait-new.jpeg",
      "authorTitle": "Founder & Steward of Strategy, 1322 Legacy Strategies",
      "image": "/images/blog-post-1-new.png",
      "category": "Stewardship Principles",
      "content": "<h2>In a world that urges you to \"accumulate more,\" we invite you to something higher: faithful stewardship.</h2><p>Management focuses on maximizing returns and minimizing risks. It's about control, efficiency, and optimization. While these aren't inherently negative, they often center on self-interest and short-term gains.</p><p>Stewardship, however, recognizes that we don't truly own anything—we are temporary caretakers of blessings entrusted to us. This perspective transforms how we view wealth:</p><h3>Stewardship Recognizes the Source</h3><p>While management asks \"How can I get more?\", stewardship asks \"How can I honor the One who provided this?\"</p><h3>Stewardship Embraces Responsibility</h3><p>Management seeks to maximize personal benefit. Stewardship seeks to maximize faithful impact.</p><h3>Stewardship Extends Beyond Lifetimes</h3><p>Management often ends at retirement or death. Stewardship thinks generationally.</p><blockquote><p>\"A good man leaves an inheritance to his children's children.\" – Proverbs 13:22</p></blockquote><p>At 13:22 Legacy Strategies, we help families shift from wealth management to wealth stewardship—a perspective that transforms not just portfolios, but purpose.</p><h2>The Problem with Traditional Financial Planning</h2><p>Most financial advisors focus on accumulation—growing your portfolio to a target number. But this approach often neglects the deeper questions:</p><ul><li>What is this wealth <em>for</em>?</li><li>How will it impact future generations?</li><li>Does it align with your values and beliefs?</li><li>Who controls your capital—you or institutions?</li></ul><p>When wealth is merely managed, these questions go unanswered. When wealth is stewarded, they become central to every decision.</p><h2>The Stewardship Mindset: A Practical Framework</h2><p>Adopting a stewardship mindset requires a fundamental shift in how you think about wealth. Here's a practical framework:</p><h3>1. Recognize the Temporary Nature of Ownership</h3><p>Everything we \"own\" is ultimately temporary. We are caretakers, not permanent owners. This perspective fosters gratitude and intentionality.</p><h3>2. Clarify Your Values and Vision</h3><p>What matters most to you? What impact do you want your wealth to have? Stewardship begins with clarity about your values and the vision for your legacy.</p><h3>3. Implement Control-Based Strategies</h3><p>True stewardship requires control. Strategies like Infinite Banking put you in the driver's seat of your capital, rather than surrendering it to institutions.</p><h3>4. Think Generationally</h3><p>Stewardship extends beyond your lifetime. How will your decisions today impact your children, grandchildren, and beyond?</p><h2>Practical Steps to Shift from Management to Stewardship</h2><p>Ready to make the shift? Here are practical steps to move from wealth management to wealth stewardship:</p><h3>Create a Family Mission Statement</h3><p>Document your family's core values, beliefs, and vision for the future. This becomes the foundation for all financial decisions.</p><h3>Reclaim Control of Your Capital</h3><p>Explore strategies like Infinite Banking that put you in control of your capital, rather than surrendering it to financial institutions.</p><h3>Design a Legacy Plan</h3><p>Work with advisors who understand stewardship to create a comprehensive legacy plan that aligns with your values and vision.</p><h3>Prepare the Next Generation</h3><p>Intentionally prepare your children and grandchildren to receive not just wealth, but wisdom.</p><h2>Conclusion: The Higher Calling</h2><p>Stewardship is a higher calling than management. It recognizes that wealth is not merely something to accumulate—it is something to steward faithfully for the benefit of others and the glory of God.</p><p>At 13:22 Legacy Strategies, we are committed to helping families embrace this higher calling. We believe that when wealth is stewarded rather than merely managed, it becomes a powerful force for good that extends for generations.</p><p>Ready to shift from wealth management to wealth stewardship? <a href=\"/contact\">Schedule a conversation</a> with our team to begin your journey.</p>",
      "relatedPosts": [
        {
          "title": "Teaching Your Children the Value of Legacy",
          "slug": "teaching-children-legacy-value",
          "image": "/images/blog-post-2.png"
        },
        {
          "title": "Infinite Banking: Becoming Your Own Source of Financing",
          "slug": "infinite-banking-concept",
          "image": "/images/blog-post-3.png"
        }
      ]
    },
    {
      "slug": "teaching-children-legacy-value",
      "title": "Teaching Your Children the Value of Legacy",
      "excerpt": "How to prepare the next generation to receive not just wealth, but wisdom. Learn practical strategies for family legacy conversations.",
      "date": "July 22, 2023",
      "readTime": "7 min read",
      "author": "Brad Raschke",
      "authorImage": "/images/brad-portrait-new.jpeg",
      "authorTitle": "Founder & Steward of Strategy, 1322 Legacy Strategies",
      "image": "/images/blog-post-2.png",
      "category": "Family Values",
      "content": "<h2>The greatest inheritance you can leave your children isn't found in your bank account—it's found in your values, your wisdom, and your vision for their future.</h2><p>Many families focus exclusively on the financial aspects of inheritance, neglecting the more important transfer of values, wisdom, and purpose. This oversight often leads to what we call \"shirtsleeves to shirtsleeves in three generations\"—where wealth built by one generation is lost by the third.</p><h2>Why Values Matter More Than Valuables</h2><p>Financial assets without wisdom often become a burden rather than a blessing. Consider these sobering statistics:</p><ul><li>70% of wealthy families lose their wealth by the second generation</li><li>90% lose it by the third generation</li><li>The primary causes are not financial mistakes, but lack of family communication and trust</li></ul><p>At 13:22 Legacy Strategies, we believe that preparing your children to receive wealth is just as important as preparing wealth for your children.</p><h2>Practical Strategies for Teaching Legacy Values</h2><h3>Start Early, Start Intentionally</h3><p>Legacy education begins long before estate planning. It starts with daily conversations about values, purpose, and stewardship.</p><h3>Create Family Mission Statements</h3><p>Work together to articulate what your family stands for, what you value, and what impact you hope to have on the world.</p><h3>Practice Stewardship Together</h3><p>Involve children in giving decisions, business discussions (age-appropriately), and financial planning conversations.</p><p>At 13:22 Legacy Strategies, we help families create intentional plans for transferring not just assets, but the wisdom needed to steward those assets faithfully.</p>",
      "relatedPosts": [
        {
          "title": "The Difference Between Stewardship and Management",
          "slug": "stewardship-vs-management",
          "image": "/images/blog-post-1-new.png"
        },
        {
          "title": "Infinite Banking: Becoming Your Own Source of Financing",
          "slug": "infinite-banking-concept",
          "image": "/images/blog-post-3.png"
        }
      ]
    },
    {
      "slug": "infinite-banking-concept",
      "title": "Infinite Banking: Becoming Your Own Source of Financing",
      "excerpt": "How to take control of your capital and break free from traditional banking dependencies through the Infinite Banking Concept.",
      "date": "August 10, 2023",
      "readTime": "6 min read",
      "author": "Brad Raschke",
      "authorImage": "/images/brad-portrait-new.jpeg",
      "authorTitle": "Founder & Steward of Strategy, 1322 Legacy Strategies",
      "image": "/images/blog-post-3.png",
      "category": "Infinite Banking",
      "content": "<h2>What if you could be your own bank? What if, instead of paying interest to financial institutions, you could recapture that capital and direct it toward your family's legacy?</h2><p>The Infinite Banking Concept (IBC) is a financial strategy that allows you to create your own banking system using dividend-paying whole life insurance. This approach puts you in control of your capital and allows you to finance purchases while still growing your wealth.</p><h2>The Problem with Traditional Banking</h2><p>When you finance purchases through traditional banks, you enrich the bank's shareholders, not your family. Every dollar of interest paid is a dollar that could have grown your legacy.</p><p>Consider this: The average American will pay over $300,000 in interest over their lifetime. That's $300,000 that could have been directed toward your family's future.</p><h2>The Power of Becoming Your Own Banker</h2><p>By creating your own banking system, you:</p><ul><li>Recapture the interest you would have paid to others</li><li>Maintain liquidity and control of your capital</li><li>Create a legacy asset that grows tax-advantaged</li><li>Build a system that can be passed down to future generations</li></ul><h3>How It Works</h3><p>The Infinite Banking Concept uses specially designed whole life insurance policies as the foundation of your personal banking system. These policies provide:</p><ul><li>Guaranteed growth</li><li>Tax-advantaged accumulation</li><li>Liquidity through policy loans</li><li>Death benefit protection</li></ul><p>When you need capital, instead of going to a traditional bank, you borrow against your policy. You set the repayment terms, and the interest you pay goes back into your policy—not to a financial institution.</p><h2>Beyond Just Numbers</h2><p>The Infinite Banking Concept isn't just about financial efficiency—it's about taking control of your capital so you can direct it according to your values and vision.</p><p>At 13:22 Legacy Strategies, we help families implement personalized Infinite Banking strategies that align with their unique legacy goals.</p>",
      "relatedPosts": [
        {
          "title": "The Difference Between Stewardship and Management",
          "slug": "stewardship-vs-management",
          "image": "/images/blog-post-1-new.png"
        },
        {
          "title": "Teaching Your Children the Value of Legacy",
          "slug": "teaching-children-legacy-value",
          "image": "/images/blog-post-2.png"
        }
      ]
    }
  ],
  "caseStudies": [
    {
      "slug": "johnson-family-legacy",
      "title": "Family Legacy Planning: The Johnson Family Story",
      "excerpt": "How a multi-generational family created a legacy plan that preserved both their wealth and their values for future generations.",
      "date": "September 5, 2023",
      "readTime": "8 min read",
      "author": "Brad Raschke",
      "authorImage": "/images/brad-portrait-new.jpeg",
      "authorTitle": "Founder & Steward of Strategy, 1322 Legacy Strategies",
      "image": "/images/family-generations.png",
      "category": "Case Study",
      "content": "<h2>The Challenge: Preserving Both Wealth and Values</h2><p>The Johnson family came to us with a common concern: \"We've built significant wealth, but we're worried about how it will impact our children and grandchildren.\"</p><p>With three adult children and seven grandchildren, they wanted to ensure their wealth would be a blessing, not a burden, to future generations.</p><h2>The Approach: Beyond Estate Planning</h2><p>We began with a comprehensive discovery process, focusing not just on the Johnsons' financial assets, but on their values, beliefs, and vision for their family's future.</p><p>Through this process, we identified their core values:</p><ul><li>Faith and spiritual growth</li><li>Education and continuous learning</li><li>Entrepreneurship and work ethic</li><li>Generosity and community impact</li></ul><h2>The Solution: A Comprehensive Legacy Strategy</h2><p>Based on the Johnsons' values and goals, we developed a multi-faceted legacy strategy:</p><h3>1. Family Banking System</h3><p>We implemented an Infinite Banking strategy using dividend-paying whole life insurance, creating a family financing system that would recapture interest and build wealth across generations.</p><h3>2. Family Constitution</h3><p>We facilitated the creation of a family constitution that articulated the family's values, vision, and governance structure.</p><h3>3. Education Trust</h3><p>We established an education trust to fund the education of future generations, with incentives aligned with the family's values.</p><h3>4. Family Meeting Structure</h3><p>We designed and facilitated regular family meetings to discuss the family's values, vision, and financial decisions.</p><h2>The Results: A Legacy That Will Last Generations</h2><p>Today, the Johnson family has:</p><ul><li>A clear articulation of their values and vision</li><li>A governance structure for family decision-making</li><li>A financing system that keeps capital within the family</li><li>A process for preparing future generations to receive wealth wisely</li></ul><p>Most importantly, they have peace of mind knowing their wealth will be a blessing, not a burden, to future generations.</p>",
      "relatedPosts": [
        {
          "title": "Teaching Your Children the Value of Legacy",
          "slug": "teaching-children-legacy-value",
          "image": "/images/blog-post-2.png"
        },
        {
          "title": "The Difference Between Stewardship and Management",
          "slug": "stewardship-vs-management",
          "image": "/images/blog-post-1-new.png"
        }
      ]
    },
    {
      "slug": "smith-manufacturing-succession",
      "title": "Business Owner Succession: Smith Manufacturing",
      "excerpt": "A case study on how proper stewardship planning helped a business owner successfully transition their company to the next generation.",
      "date": "October 12, 2023",
      "readTime": "9 min read",
      "author": "Brad Raschke",
      "authorImage": "/images/brad-portrait-new.jpeg",
      "authorTitle": "Founder & Steward of Strategy, 1322 Legacy Strategies",
      "image": "/images/financial-planning.png",
      "category": "Case Study",
      "content": "<h2>The Challenge: Transitioning a Family Business</h2><p>After building Smith Manufacturing for over 30 years, John Smith was ready to transition the business to his son, Michael. However, he faced several challenges:</p><ul><li>How to equitably provide for his three children when only one was involved in the business</li><li>How to minimize tax implications of the transition</li><li>How to ensure the business would continue to thrive under new leadership</li><li>How to fund his retirement without burdening the business</li></ul><h2>The Approach: Integrated Succession Planning</h2><p>We began with a comprehensive discovery process to understand John's values, goals, and concerns. We then developed an integrated succession plan that addressed all aspects of the transition.</p><h2>The Solution: A Multi-Faceted Strategy</h2><h3>1. Infinite Banking for Liquidity</h3><p>We implemented an Infinite Banking strategy using dividend-paying whole life insurance, creating a source of liquidity for both John's retirement and the business transition.</p><h3>2. Buy-Sell Agreement</h3><p>We structured a buy-sell agreement that allowed Michael to purchase the business over time, with terms that were favorable to both parties.</p><h3>3. Equalization Strategy</h3><p>We developed a strategy to equalize the inheritance for John's other two children, ensuring fairness without burdening the business.</p><h3>4. Leadership Transition Plan</h3><p>We facilitated a structured leadership transition plan, including mentoring, gradual transfer of responsibilities, and clear communication with employees and customers.</p><h2>The Results: A Successful Transition</h2><p>Today, Smith Manufacturing continues to thrive under Michael's leadership, while John enjoys a comfortable retirement. The transition was accomplished with minimal tax impact, and all three children feel they were treated fairly in the process.</p><p>Most importantly, the values and culture that made Smith Manufacturing successful for three decades continue to guide the company into the future.</p>",
      "relatedPosts": [
        {
          "title": "Infinite Banking: Becoming Your Own Source of Financing",
          "slug": "infinite-banking-concept",
          "image": "/images/blog-post-3.png"
        },
        {
          "title": "The Difference Between Stewardship and Management",
          "slug": "stewardship-vs-management",
          "image": "/images/blog-post-1-new.png"
        }
      ]
    },
    {
      "slug": "williams-tax-efficient-transfer",
      "title": "Tax-Efficient Wealth Transfer: The Williams Strategy",
      "excerpt": "How the Williams family reduced their tax burden by 68% while increasing their generational wealth transfer through strategic planning.",
      "date": "November 8, 2023",
      "readTime": "7 min read",
      "author": "Brad Raschke",
      "authorImage": "/images/brad-portrait-new.jpeg",
      "authorTitle": "Founder & Steward of Strategy, 1322 Legacy Strategies",
      "image": "/images/legacy-handoff.png",
      "category": "Case Study",
      "content": "<h2>The Challenge: Minimizing Tax Impact on Wealth Transfer</h2><p>The Williams family had accumulated significant wealth through a successful business and prudent investments. As they approached retirement, they were concerned about the potential tax impact on their estate.</p><p>Their initial estate plan would have resulted in over $2.8 million in estate taxes, significantly reducing the legacy they could pass to their children and grandchildren.</p><h2>The Approach: Strategic Tax Planning</h2><p>We conducted a comprehensive analysis of the Williams' assets, income sources, and estate plan. We then developed a strategic plan to minimize tax impact while maximizing the legacy they could pass to future generations.</p><h2>The Solution: A Comprehensive Tax Strategy</h2><h3>1. Infinite Banking Structure</h3><p>We implemented an Infinite Banking strategy using dividend-paying whole life insurance, creating a tax-advantaged vehicle for wealth accumulation and transfer.</p><h3>2. Strategic Gifting Plan</h3><p>We developed a strategic gifting plan to utilize annual gift tax exclusions and lifetime exemptions efficiently.</p><h3>3. Charitable Remainder Trust</h3><p>We established a Charitable Remainder Trust for certain appreciated assets, providing income during retirement while reducing tax impact.</p><h3>4. Family Limited Partnership</h3><p>We structured a Family Limited Partnership to facilitate business succession and provide valuation discounts for estate tax purposes.</p><h2>The Results: Significant Tax Savings</h2><p>Through our comprehensive strategy, the Williams family:</p><ul><li>Reduced their projected estate tax burden by 68%</li><li>Increased the total wealth transferred to future generations by over $3.2 million</li><li>Created a structure for ongoing family stewardship of assets</li><li>Established a legacy of charitable giving aligned with their values</li></ul><p>Most importantly, they gained peace of mind knowing they had maximized the impact of their lifetime of stewardship.</p>",
      "relatedPosts": [
        {
          "title": "Infinite Banking: Becoming Your Own Source of Financing",
          "slug": "infinite-banking-concept",
          "image": "/images/blog-post-3.png"
        },
        {
          "title": "Teaching Your Children the Value of Legacy",
          "slug": "teaching-children-legacy-value",
          "image": "/images/blog-post-2.png"
        }
      ]
    }
  ],
  "categories": [
    "Stewardship Principles",
    "Infinite Banking",
    "Legacy Planning",
    "Tax Strategy",
    "Family Values",
    "Case Studies"
  ]
}
